
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/18801065604)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 10 to change, 1 to destroy.</code></pre>

* Update
  * cloudflare_dns_record.github-pages_domain_verification
  * cloudflare_dns_record.homepage
  * cloudflare_dns_record.homepage__www
  * cloudflare_dns_record.mail-server__dkim
  * cloudflare_dns_record.mail-server__dmarc
  * cloudflare_dns_record.mail-server__primary
  * cloudflare_dns_record.mail-server__secondary
  * cloudflare_dns_record.mail-server__spf
  * cloudflare_pages_project.homepage
  * cloudflare_zero_trust_access_group.allow_github
* Delete
  * cloudflare_dns_record.auth0_domain


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record.auth0_domain will be destroyed
  # (because cloudflare_dns_record.auth0_domain is not in configuration)
  - resource "cloudflare_dns_record" "auth0_domain" {
      - comment             = "for Auth0" -> null
      - comment_modified_on = "2025-10-25T06:51:55Z" -> null
      - content             = "dev-ylboliln6z4iuhd7-cd-jhudqctvydtf51ka.edge.tenants.jp.auth0.com" -> null
      - created_on          = "2025-10-25T06:51:55Z" -> null
      - id                  = "8b77954d2063a988a4366c74940606f7" -> null
      - meta                = jsonencode({})
      - modified_on         = "2025-10-25T06:51:55Z" -> null
      - name                = "auth.clov3r.cc" -> null
      - proxiable           = true -> null
      - proxied             = false -> null
      - settings            = {
          - flatten_cname = false -> null
        } -> null
      - tags                = [] -> null
      - ttl                 = 1 -> null
      - type                = "CNAME" -> null
      - zone_id             = "b52fd73ec52e35fea1807a173e33e93a" -> null
    }

  # cloudflare_dns_record.github-pages_domain_verification will be updated in-place
  ~ resource "cloudflare_dns_record" "github-pages_domain_verification" {
      ~ comment             = "for GitHub Pages Domain Verification" -> "for GitHub Pages Domain Verification (This resource is managed with Terraform)"
      ~ comment_modified_on = "2025-10-25T06:51:55Z" -> (known after apply)
        id                  = "72c031f5cdba4c85f78a508158700c90"
      ~ modified_on         = "2025-10-25T06:51:55Z" -> (known after apply)
        name                = "_gh-clov3r-cc-o.clov3r.cc"
        tags                = []
        # (9 unchanged attributes hidden)
    }

  # cloudflare_dns_record.homepage will be updated in-place
  ~ resource "cloudflare_dns_record" "homepage" {
      ~ comment             = "for my homepage in Cloudflare Pages" -> "for my homepage in Cloudflare Pages (This resource is managed with Terraform)"
      ~ comment_modified_on = "2025-10-25T06:51:57Z" -> (known after apply)
        id                  = "74f600801098f6167c1a26218f110b45"
      ~ modified_on         = "2025-10-25T06:51:57Z" -> (known after apply)
        name                = "clov3r.cc"
        tags                = []
        # (9 unchanged attributes hidden)
    }

  # cloudflare_dns_record.homepage__www will be updated in-place
  ~ resource "cloudflare_dns_record" "homepage__www" {
      ~ comment             = "for my homepage in Cloudflare Pages" -> "for my homepage in Cloudflare Pages (This resource is managed with Terraform)"
      ~ comment_modified_on = "2025-10-25T06:51:57Z" -> (known after apply)
        id                  = "e941ef6049a44c0633720cb32cdd90c2"
      ~ modified_on         = "2025-10-25T06:51:57Z" -> (known after apply)
        name                = "www.clov3r.cc"
        tags                = []
        # (9 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mail-server__dkim will be updated in-place
  ~ resource "cloudflare_dns_record" "mail-server__dkim" {
      ~ comment             = "for DKIM authentication" -> "for DKIM authentication (This resource is managed with Terraform)"
      ~ comment_modified_on = "2025-10-25T06:51:55Z" -> (known after apply)
        id                  = "a8dfaaf3ea0e6ade9cbdb8ae8f28a73e"
      ~ modified_on         = "2025-10-25T06:51:55Z" -> (known after apply)
        name                = "rs20240724._domainkey.clov3r.cc"
        tags                = []
        # (9 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mail-server__dmarc will be updated in-place
  ~ resource "cloudflare_dns_record" "mail-server__dmarc" {
      ~ comment             = "for DMARC authentication" -> "for DMARC authentication (This resource is managed with Terraform)"
      ~ comment_modified_on = "2025-10-25T06:51:55Z" -> (known after apply)
        id                  = "64c1a3e9a9e6c2c65c5bcaab39ddefcb"
      ~ modified_on         = "2025-10-25T06:51:55Z" -> (known after apply)
        name                = "_dmarc.clov3r.cc"
        tags                = []
        # (9 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mail-server__primary will be updated in-place
  ~ resource "cloudflare_dns_record" "mail-server__primary" {
      ~ comment             = "for primary mail server in Sakura Internet" -> "for primary mail server in Sakura Internet (This resource is managed with Terraform)"
      ~ comment_modified_on = "2025-10-25T06:51:55Z" -> (known after apply)
        id                  = "8b6fc16cd3206d477d50a44ac1716efb"
      ~ modified_on         = "2025-10-25T06:51:55Z" -> (known after apply)
        name                = "clov3r.cc"
        tags                = []
        # (10 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mail-server__secondary will be updated in-place
  ~ resource "cloudflare_dns_record" "mail-server__secondary" {
      ~ comment             = "for secondary mail server in Sakura Internet" -> "for secondary mail server in Sakura Internet (This resource is managed with Terraform)"
      ~ comment_modified_on = "2025-10-25T06:51:55Z" -> (known after apply)
        id                  = "3e2c7b1dad06badfd1f48e820ee5f83c"
      ~ modified_on         = "2025-10-25T06:51:55Z" -> (known after apply)
        name                = "clov3r.cc"
        tags                = []
        # (10 unchanged attributes hidden)
    }

  # cloudflare_dns_record.mail-server__spf will be updated in-place
  ~ resource "cloudflare_dns_record" "mail-server__spf" {
      ~ comment             = "for SPF authentication" -> "for SPF authentication (This resource is managed with Terraform)"
      ~ comment_modified_on = "2025-10-25T06:51:55Z" -> (known after apply)
        id                  = "dcbf99e8a03575d4972f90c714078ded"
      ~ modified_on         = "2025-10-25T06:51:55Z" -> (known after apply)
        name                = "clov3r.cc"
        tags                = []
        # (9 unchanged attributes hidden)
    }

  # cloudflare_pages_project.homepage will be updated in-place
  ~ resource "cloudflare_pages_project" "homepage" {
      - build_config         = {} -> null
      ~ canonical_deployment = {
          ~ aliases            = [
              - "https://clov3r.cc",
              - "https://www.clov3r.cc",
            ] -> (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-10-25T06:56:49Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  + commit_hash    = (known after apply)
                  + commit_message = (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "954348d9-13d3-4816-8890-335b129aaee8" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-10-25T06:56:52Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-10-25T06:56:52Z" -> (known after apply)
          ~ project_id         = "f9e9ebc0-fd49-433a-9d6c-ecf93d800066" -> (known after apply)
          ~ project_name       = "my-home" -> (known after apply)
          ~ short_id           = "954348d9" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-10-25T06:56:49Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-10-25T06:56:52Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://954348d9.my-home.pages.dev" -> (known after apply)
        } -> (known after apply)
      ~ created_on           = "2025-10-25T06:51:55Z" -> (known after apply)
      ~ deployment_configs   = {
          ~ preview    = {
              - compatibility_date  = "2025-10-25" -> null
              - compatibility_flags = [] -> null
            }
          ~ production = {
              - compatibility_flags = [] -> null
                # (1 unchanged attribute hidden)
            }
        }
      ~ domains              = [
          - "my-home.pages.dev",
          - "clov3r.cc",
          - "www.clov3r.cc",
        ] -> (known after apply)
        id                   = "my-home"
      ~ latest_deployment    = {
          ~ aliases            = [
              - "https://clov3r.cc",
              - "https://www.clov3r.cc",
            ] -> (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-10-25T06:56:49Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  + commit_hash    = (known after apply)
                  + commit_message = (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "954348d9-13d3-4816-8890-335b129aaee8" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-10-25T06:56:52Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-10-25T06:56:52Z" -> (known after apply)
          ~ project_id         = "f9e9ebc0-fd49-433a-9d6c-ecf93d800066" -> (known after apply)
          ~ project_name       = "my-home" -> (known after apply)
          ~ short_id           = "954348d9" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-10-25T06:56:49Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-10-25T06:56:52Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://954348d9.my-home.pages.dev" -> (known after apply)
        } -> (known after apply)
        name                 = "my-home"
      ~ subdomain            = "my-home.pages.dev" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_group.allow_github will be updated in-place
  ~ resource "cloudflare_zero_trust_access_group" "allow_github" {
        id         = "4f3b3cf0-3586-4b46-830c-a74e62b368b6"
      ~ name       = "Allow GitHub" -> "Allow GitHub (This resource is managed with Terraform)"
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 10 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":108,"Program":"tfcmt","SHA1":"8e9bdfa84c018411cc250fbb19a5c852f1034deb","Vars":{},"WorkflowName":"Terraform CI"} -->